# coding: utf-8

# a↑↑b = a^(a^(a^ ... (a^a))) のように a の右上に a が b 個続く数である.
# gcd(1777, 1000) = 1 なのでオイラーの小定理 φ(10^8) = 4*10^7 を用いて,
#
# 1777^(4*10^7) = 1 mod 10^8
#
# 一番右上の指数計算は
# x1 = 1777^1777 mod 10^8
#
# 次の指数計算は
# x2 = 1777^x1 mod 10^8 = 1777^(x1 mod 4*10^7) mod 10^8
#
# さらに次の指数計算は
# x3 = 1777^x2 mod 10^8 = 1777^(x2 mod 4*10^7) mod 10^8
#
# これを 1855回繰り返せば
# 1777↑↑1855 = 1777^x1854 = 1777^(x1854 mod 4*10^7) mod 10^8
#
# が求まる.


def main():
    A = 1777
    E = 1855
    N = 10**8

    phi_n = 4 * N // 10
    x = 1
    for _ in range(E):
        x = pow(A, x % phi_n, N)
    return x


if __name__ == '__main__':
    print(main())
